// TODO: 必要な関数やデータ型をインポートしてください
import {} from "./pay";

// **************************************************
// 要素一覧
// **************************************************

const form = document.getElementById("form") as HTMLFormElement;
// TODO: 必要に応じて追加してください

// **************************************************
// 変数一覧と定数一覧
// **************************************************

// TODO: 必要に応じて追加してください

// **************************************************
// イベントの登録処理
// **************************************************

form.addEventListener("submit", submitPayCharge);
// TODO: 必要に応じて追加してください

// **************************************************
// 処理
// **************************************************

// TODO: チャージのsubmitイベントを実装してください
// MEMO: チャージが完了できたら/completeに画面遷移します
// MEMO: チャージが失敗したらアラートでエラーメッセージを出力します
function submitPayCharge(event: SubmitEvent) {}
